Tekla.Structures.Model.PolyBeam.PolyBeamTypeEnum
The polybeam types.

Tekla.Structures.Model.PolyBeam.PolyBeamTypeEnum.BEAM
The polybeam.

Tekla.Structures.Model.PolyBeam.PolyBeamTypeEnum.PANEL
The panel.

Tekla.Structures.Model.PolyBeam.PolyBeamTypeEnum.STRIP_FOOTING
The strip footing.

Tekla.Structures.Model.PolyBeam.PolyBeamTypeEnum.COLUMN
The column.